Strömungssimulation/Beleg/simulationen/wärmeübertrager_1/constant/archive/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState incompressiblePerfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture // air at room temperature (293 K)
{
    equationOfState
    {
    	pRef	1e5;
    }

    specie
    {
        molWeight   28.9;
    }
    thermodynamics
    {
        Cp          1005;
        hf          0;
    }
    transport
    {
        mu          1.82e-05;
        Pr          0.71;
    }
}

// ************************************************************************* //
