Strömungssimulation/Beleg/simulationen/wärmeübertrager_1/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 29.8;

boundaryField
{
    // DONE: Setzen Sie die "mixingLength" auf den halben Rohrdurchmesser.
    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
	mixingLength	0.0075;
        value           uniform 29.8;
    }

    outlet
    {
        type            zeroGradient;
    }

    "pipe.*"
    {
        type            omegaWallFunction;
        value           uniform 29.8;
    }

    frontAndBack
    {
        type            empty;
    }

    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
}


// ************************************************************************* //
