Strömungssimulation/Beleg/simulationen/wärmeübertrager_1/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    pipe-0
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
3.09448
3.0902
3.0902
3.09396
3.09396
3.0902
3.09487
3.09126
...
)
;
    }
    pipe-1
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
3.09006
3.09103
3.08589
3.09156
3.09261
3.09035
3.09012
3.09559
...
)
;
    }
    pipe-2
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
3.09075
3.09499
3.09071
3.09484
3.0942
3.09497
3.09524
3.09127
...
)
;
    }
    pipe-5
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
3.08972
3.09486
3.09517
3.09123
3.09485
3.09073
3.09417
3.09475
...
)
;
    }
    pipe-3
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
3.09393
3.09009
3.0901
3.09458
3.09036
3.0901
3.09009
3.09393
...
)
;
    }
    pipe-4
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
3.09553
3.09018
3.09451
3.09176
3.09035
3.09245
3.09562
3.09122
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
}


// ************************************************************************* //
